# Terminal Tools
brew "eza"
brew "ripgrep"
brew "fzf"
brew "bat"
brew "fd"
brew "starship"
brew "glow"
brew "btop"
brew "duf"
brew "bandwhich"
brew "lazygit"
brew "pgcli"
brew "pspg"
brew "pgformatter"
brew "duckdb"

# Taps
tap "xo/xo"
brew "usql"

# Development Tools
brew "direnv"
brew "nvm"
brew "gh"

# Casks (macOS only)
cask "font-fira-code-nerd-font"